/*
* This file was autogenerated by openCONFIGURATOR-2.2.1_release on 23-Nov-2023 14:59:07
* Project: ASTREOS-1_OpenPOWERLINK
* Application process for openPOWERLINK_MN(240)
*/
#ifndef XAPOPL_h
#define XAPOPL_h

#define COMPUTED_PI_OUT_SIZE 75
typedef union
{
	struct
	{
		INT16 CN1_Output_AI16_EC1;										//0
		INT8 CN1_Output_AI8_VALVE1;										//1
		INT8 CN1_Output_AI8_VALVE2;										//2
		INT8 CN1_Output_AI8_VALVE3;										//3
		INT8 CN1_Output_AI8_VALVE4;										//4
		INT8 CN1_Output_AI8_VALVE5;										//5
		INT8 CN1_Output_AI8_VALVE6;										//6
		INT8 CN1_Output_AI8_VALVE7;										//7
		INT8 CN1_Output_AI8_VALVE8;										//8
		INT8 CN1_Output_AI8_VALVE9;										//9
		INT8 CN1_Output_AI8_VALVE10;									//10
		INT8 CN1_Output_AI8_VALVE11;									//11
		INT8 CN1_Output_AI8_VALVE12;									//12
		INT32 CN1_Output_AI32_SENSOR1;									//13
		INT32 CN1_Output_AI32_SENSOR2;									//14
		INT32 CN1_Output_AI32_SENSOR3;									//15
		INT32 CN1_Output_AI32_SENSOR4;									//16
		INT32 CN1_Output_AI32_SENSOR5;									//17
		INT32 CN1_Output_AI32_SENSOR6;									//18
		INT32 CN1_Output_AI32_SENSOR7;									//19
		INT32 CN1_Output_AI32_SENSOR8;									//20
		INT32 CN1_Output_AI32_SENSOR9;									//21
		INT32 CN1_Output_AI32_SENSOR10;									//22
		INT32 CN1_Output_AI32_SENSOR11;									//23
		INT32 CN1_Output_AI32_SENSOR12;									//24
		INT16 CN2_Output_AI16_EC2;										//25
		INT8 CN2_Output_AI8_VALVE1;										//26
		INT8 CN2_Output_AI8_VALVE2;										//27
		INT8 CN2_Output_AI8_VALVE3;										//28
		INT8 CN2_Output_AI8_VALVE4;										//29
		INT8 CN2_Output_AI8_VALVE5;										//30
		INT8 CN2_Output_AI8_VALVE6;										//31
		INT8 CN2_Output_AI8_VALVE7;										//32
		INT8 CN2_Output_AI8_VALVE8;										//33
		INT8 CN2_Output_AI8_VALVE9;										//34
		INT8 CN2_Output_AI8_VALVE10;									//35
		INT8 CN2_Output_AI8_VALVE11;									//36
		INT8 CN2_Output_AI8_VALVE12;									//37
		INT32 CN2_Output_AI32_SENSOR1;									//38
		INT32 CN2_Output_AI32_SENSOR2;									//39
		INT32 CN2_Output_AI32_SENSOR3;									//40
		INT32 CN2_Output_AI32_SENSOR4;									//41
		INT32 CN2_Output_AI32_SENSOR5;									//42
		INT32 CN2_Output_AI32_SENSOR6;									//43
		INT32 CN2_Output_AI32_SENSOR7;									//44
		INT32 CN2_Output_AI32_SENSOR8;									//45
		INT32 CN2_Output_AI32_SENSOR9;									//46
		INT32 CN2_Output_AI32_SENSOR10;									//47
		INT32 CN2_Output_AI32_SENSOR11;									//48
		INT32 CN2_Output_AI32_SENSOR12;									//49
		INT16 CN3_Output_AI16_EC3;										//50
		INT8 CN3_Output_AI8_VALVE1;										//51
		INT8 CN3_Output_AI8_VALVE2;										//52
		INT8 CN3_Output_AI8_VALVE3;										//53
		INT8 CN3_Output_AI8_VALVE4;										//54
		INT8 CN3_Output_AI8_VALVE5;										//55
		INT8 CN3_Output_AI8_VALVE6;										//56
		INT8 CN3_Output_AI8_VALVE7;										//57
		INT8 CN3_Output_AI8_VALVE8;										//58
		INT8 CN3_Output_AI8_VALVE9;										//59
		INT8 CN3_Output_AI8_VALVE10;									//60
		INT8 CN3_Output_AI8_VALVE11;									//61
		INT8 CN3_Output_AI8_VALVE12;									//62
		INT32 CN3_Output_AI32_SENSOR1;									//63
		INT32 CN3_Output_AI32_SENSOR2;									//64
		INT32 CN3_Output_AI32_SENSOR3;									//65
		INT32 CN3_Output_AI32_SENSOR4;									//66
		INT32 CN3_Output_AI32_SENSOR5;									//67
		INT32 CN3_Output_AI32_SENSOR6;									//68
		INT32 CN3_Output_AI32_SENSOR7;									//69
		INT32 CN3_Output_AI32_SENSOR8;									//70
		INT32 CN3_Output_AI32_SENSOR9;									//71
		INT32 CN3_Output_AI32_SENSOR10;									//72
		INT32 CN3_Output_AI32_SENSOR11;									//73
		INT32 CN3_Output_AI32_SENSOR12;									//74
	} PI_OUT;
	signed out_CN_array[COMPUTED_PI_OUT_SIZE];
} UNION_OUT;

#define COMPUTED_PI_IN_SIZE 39
typedef union
{
	struct
	{
		INT16 CN1_Input_AI16_EG;									//0
		INT8 CN1_Input_AI8_VALVE1;									//1
		INT8 CN1_Input_AI8_VALVE2;									//2
		INT8 CN1_Input_AI8_VALVE3;									//3
		INT8 CN1_Input_AI8_VALVE4;									//4
		INT8 CN1_Input_AI8_VALVE5;									//5
		INT8 CN1_Input_AI8_VALVE6;									//6
		INT8 CN1_Input_AI8_VALVE7;									//7
		INT8 CN1_Input_AI8_VALVE8;									//8
		INT8 CN1_Input_AI8_VALVE9;									//9
		INT8 CN1_Input_AI8_VALVE10;									//10
		INT8 CN1_Input_AI8_VALVE11;									//11
		INT8 CN1_Input_AI8_VALVE12;									//12
		INT16 CN2_Input_AI16_EG;									//13
		INT8 CN2_Input_AI8_VALVE1;									//14
		INT8 CN2_Input_AI8_VALVE2;									//15
		INT8 CN2_Input_AI8_VALVE3;									//16
		INT8 CN2_Input_AI8_VALVE4;									//17
		INT8 CN2_Input_AI8_VALVE5;									//18
		INT8 CN2_Input_AI8_VALVE6;									//19
		INT8 CN2_Input_AI8_VALVE7;									//20
		INT8 CN2_Input_AI8_VALVE8;									//21
		INT8 CN2_Input_AI8_VALVE9;									//22
		INT8 CN2_Input_AI8_VALVE10;									//23
		INT8 CN2_Input_AI8_VALVE11;									//24
		INT8 CN2_Input_AI8_VALVE12;									//25
		INT16 CN3_Input_AI16_EG;									//26
		INT8 CN3_Input_AI8_VALVE1;									//27
		INT8 CN3_Input_AI8_VALVE2;									//28
		INT8 CN3_Input_AI8_VALVE3;									//29
		INT8 CN3_Input_AI8_VALVE4;									//30
		INT8 CN3_Input_AI8_VALVE5;									//31
		INT8 CN3_Input_AI8_VALVE6;									//32
		INT8 CN3_Input_AI8_VALVE7;									//33
		INT8 CN3_Input_AI8_VALVE8;									//34
		INT8 CN3_Input_AI8_VALVE9;									//35
		INT8 CN3_Input_AI8_VALVE10;									//36
		INT8 CN3_Input_AI8_VALVE11;									//37
		INT8 CN3_Input_AI8_VALVE12;									//38
	} PI_IN;
	signed in_CN_array[COMPUTED_PI_IN_SIZE];
} UNION_IN;

#endif
